In [2]:
import numpy as np
import pandas as s

In [3]:
ser = s.Series([5,6,7,8,0,9,1], index = ["mon","tue","wed","thurs","fri","sat","sun"])

In [4]:
ser = ser * 2

In [5]:
print(ser)

mon      10
tue      12
wed      14
thurs    16
fri       0
sat      18
sun       2
dtype: int64

In [6]:
print("Wednesday Sales : ",ser["wed"])
print("Friday Sales : ",ser["fri"])

Wednesday Sales :  14
Friday Sales :  0

In [7]:
ser[2:6]

wed      14
thurs    16
fri       0
sat      18
dtype: int64

In [9]:
pro_data = {"Sindh": 2000,"Punjab":3000,"KPK":4000,"Balochistan":5000}
tx = s.Series(pro_data,index = ["Sindh","Punjab","KPK","Balochistan","Gilgit Baltistan"])
print(tx)
print()
print(s.isnull(tx))

Sindh               2000.0
Punjab              3000.0
KPK                 4000.0
Balochistan         5000.0
Gilgit Baltistan       NaN
dtype: float64

Sindh               False
Punjab              False
KPK                 False
Balochistan         False
Gilgit Baltistan     True
dtype: bool

In [10]:
tx["Sindh"] = np.nan

In [12]:
print(tx)
print()
print(s.isnull(tx))

Sindh                  NaN
Punjab              3000.0
KPK                 4000.0
Balochistan         5000.0
Gilgit Baltistan       NaN
dtype: float64

Sindh                True
Punjab              False
KPK                 False
Balochistan         False
Gilgit Baltistan     True
dtype: bool

In [14]:
apple = s.Series([3,6,4,2,55],index = ["one","two","three","four","five"], name = "")
orange = s.Series([1,6,43,2,12])
orange.index = apple.index
list = [88,34,22,32,21]

data = {"apples":apple, "oranges":orange,"banana": list}
df = s.DataFrame(data)
print(df)

       apples  oranges  banana
one         3        1      88
two         6        6      34
three       4       43      22
four        2        2      32
five       55       12      21

In [15]:
df.head()

       apples  oranges  banana
one         3        1      88
two         6        6      34
three       4       43      22
four        2        2      32
five       55       12      21

In [121]:
state = ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"]
data = {"State": state ,
       "Year"  : [2000,2001,2002,2001,2002,2003],
       "Pop."   : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = s.DataFrame(data,columns = ["Year","State","Pop.","Debt"],index = ["one","two","three","four","five","six"])
frame["Debt"] = [1,2,3,4,5,6,]

In [123]:
frame.head(6)

       Year   State  Pop.  Debt
one    2000    Ohio   1.5     1
two    2001    Ohio   1.7     2
three  2002    Ohio   3.6     3
four   2001  Nevada   2.4     4
five   2002  Nevada   2.9     5
six    2003  Nevada   3.2     6